IdeaRS.Connections
SpliceData.ConnectionType Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the type of connection of two parts.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ConnectionType ConnectionType { get; set; }
Property Value
Type: ConnectionType
See Also
Reference
SpliceData Class
IdeaRS.Connections.Data Namespace